Revit 2027 API
BuiltInFailures.StairRampFailures.WinderTooManyParallelTreadsAtEndFailure Property
 The number of parallel treads at end is too great.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderTooManyParallelTreadsAtEndFailure { get; }
Public Shared ReadOnly Property WinderTooManyParallelTreadsAtEndFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderTooManyParallelTreadsAtEndFailure {
	FailureDefinitionId^ get ();
}
static member WinderTooManyParallelTreadsAtEndFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace